import 'package:get/get.dart';

class HomeController extends GetxController {
  List<String> reformProposals = [
    "জাতীয় নির্বাচনের আগে স্থানীয় সরকার নির্বাচনের আয়োজন করা।",
    "সংসদীয় নির্বাচনে প্রতিদ্বন্দ্বিতা করার ন্যূনতম বয়স কমিয়ে ২১ বছর করা।",
    "সংবিধানের মূলনীতি ও রাষ্ট্র পরিচালনার মূলনীতি হিসেবে ধর্মনিরপেক্ষতা, সমাজতন্ত্র ও জাতীয়তাবাদ এবং এ সংক্রান্ত সংবিধানের ৮, ৯, ১০ ও ১২ অনুচ্ছেদগুলি বাদ দেওয়া।",
    "রাষ্ট্রপতির মেয়াদ হবে ৪ বছর। রাষ্ট্রপতি সর্বোচ্চ দুই বারের বেশি অধিষ্ঠিত থাকতে পারবেন না।",
    "১০০ আসন নিয়ে সংসদের উচ্চকক্ষ সৃষ্টি করা।",
    "সংবিধানের মূলনীতি হিসেবে ‘সাম্য, মানবিক মর্যাদা, সামাজিক সুবিচার, বহুদলবাদ এবং গণতন্ত্র’ অন্তর্ভুক্ত করা।",
    "সংবিধানের যেকোনো সংশোধনী উচ্চ কক্ষের দুই-তৃতীয়াংশ সংখ্যানুপাতে এবং গণভোটের মাধ্যমে অনুমোদন করা।",
    "সরাসরি ভোটে নির্বাচিত ৪০০ প্রতিনিধির সমন্বয়ে নিম্নকক্ষ গঠন করা।",
    "দুইবার নির্বাচিত প্রধানমন্ত্রীকে রাষ্ট্রপতি পদে নির্বাচনের অযোগ্য করা।",
    "প্রধানমন্ত্রী থাকা অবস্থায় তিনি কোনো রাজনৈতিক দলের প্রধান এবং সংসদ নেতা হিসেবে অধিষ্ঠিত থাকতে পারবেন না।",
    "একজন ব্যক্তি প্রধানমন্ত্রী হিসেবে সর্বোচ্চ দুইবার দায়িত্ব পালন করতে পারবেন। তিনি একাধিক মেয়াদে অথবা অন্য যে কোনো উপায়ে দুইবারের বেশি প্রধানমন্ত্রী পদে আসীন হতে পারবেন না।",
    "প্রস্তাবিত ৪০০ আসনের মধ্যে ৩০০টি আসন সাধারণ প্রতিদ্বন্দ্বিতার জন্য উন্মুক্ত থাকবে এবং ১০০টি আসনে কেবলমাত্র নারী প্রার্থীরা প্রতিদ্বন্দ্বিতা করবেন।",
    "দুর্নীতি বিরোধী জাতীয় কৌশলপত্র প্রণয়ন এবং দুর্নীতি দমনে ন্যায়পাল (Ombudsman) পদের ব্যবস্থা করা।",
    "দেশের পুরাতন চারটি বিভাগের সীমানাকে চারটি প্রদেশে বিভক্ত করে প্রাদেশিক শাসনব্যবস্থা চালু করা।",
  ];

  RxBool isLoading = false.obs;

  // Questions List
  final List<Map<String, dynamic>> questions = [
    {
      "text":
          "You believe that being realistic about your goals is more important than being passionate about them.",
    },
    {"text": "Your living and working spaces are clean and organized."},
  ];

  // Answers List (default value -1 means no selection)
  RxList<int> selectedAnswers = List<int>.filled(2, -1).obs;

  // Function to update answers
  void selectAnswer(int questionIndex, int value) {
    selectedAnswers[questionIndex] = value;
  }
}
